# GetDistanceToTargetCover Method

---
C#Visual BasicVisual C++
Revit 2024 API
---
RebarConstraint..::..GetDistanceToTargetCover Method
RebarConstraint Class See Also
---
Returns the distance from the RebarConstrainedHandle to the target Host Cover Element surface. The RebarConstraintType of the RebarConstraint must be 'ToCover.'
**Namespace:** Autodesk.Revit.DB.Structure**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public double GetDistanceToTargetCover()
```

Visual Basic
---
```text
Public Function GetDistanceToTargetCover As Double
```

Visual C++
---
```text
public:
double GetDistanceToTargetCover()
```

# Exceptions
| Exception | Condition |
| --- | --- |
| --- | --- |
| Autodesk.Revit.Exceptions..::..InvalidOperationException | RebarConstraint is no longer valid. -or- The RebarConstraint is not of RebarConstraintType 'ToCover.' |

# See Also
RebarConstraint Class
Autodesk.Revit.DB.Structure Namespace